---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomBaseLightingLoadOnParam
source: html/d66d3829-d82c-2367-c9f9-e2c14ac85640.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomBaseLightingLoadOnParam Property

"Base Lighting Load on"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomBaseLightingLoadOnParam { get; }
```